# Pandas Part 2

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

In [2]:
iris = sns.load_dataset('iris')
titanic = sns.load_dataset('titanic')

### 5. 데이터프레임 데이터 조작(계속)

- apply

In [3]:
df = pd.DataFrame({
    'A': [1, 3, 4, 3, 4],
    'B': [2, 3, 1, 2, 3],
    'C': [1, 5, 2, 4, 4]
})
df

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [5]:
# 각 열에 대해 최대값과 최소값의 차이를 구하고자 할때
df.apply(lambda x: x.max() - x.min())

A    3
B    2
C    4
dtype: int64

In [6]:
# 각 행에 적용
df.apply(lambda x: x.max() - x.min(), axis=1)

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [7]:
def max2min(x):
    return x.max() - x.min()

In [8]:
df.apply(max2min)

A    3
B    2
C    4
dtype: int64

In [9]:
# 타이타닉호의 승객 중 나이 20살을 기준으로 성인(adult)과 미성년자(child)를
# 구별하는 라벨 열을 만들 때
titanic.head(3)

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True

[3 rows x 15 columns]

In [11]:
titanic['adult/child'] = titanic.apply(lambda r: 'adult' if r.age > 20 else 'child', axis=1)
titanic.head(3)

   survived  pclass     sex   age  ...  embark_town  alive  alone adult/child
0         0       3    male  22.0  ...  Southampton     no  False       adult
1         1       1  female  38.0  ...    Cherbourg    yes  False       adult
2         1       3  female  26.0  ...  Southampton    yes   True       adult

[3 rows x 16 columns]

In [12]:
titanic.tail(3)

     survived  pclass     sex   age  ...  embark_town  alive  alone adult/child
888         0       3  female   NaN  ...  Southampton     no  False       child
889         1       1    male  26.0  ...    Cherbourg    yes   True       adult
890         0       3    male  32.0  ...   Queenstown     no   True       adult

[3 rows x 16 columns]

- 문자열 조작

In [13]:
from google.colab import files
uploaded = files.upload()
filename = list(uploaded.keys())[0]

Saving 법정동코드.txt to 법정동코드.txt

In [16]:
df = pd.read_csv(filename, sep='\t', encoding='euc-kr')
df = df[df.폐지여부 == '존재']
df.head()

        법정동코드           법정동명 폐지여부
0  1100000000          서울특별시   존재
1  1111000000      서울특별시 종로구   존재
2  1111010100  서울특별시 종로구 청운동   존재
3  1111010200  서울특별시 종로구 신교동   존재
4  1111010300  서울특별시 종로구 궁정동   존재

In [18]:
# 인덱싱
df['법정동명'].str[-5:].head()

0    서울특별시
1    시 종로구
2    구 청운동
3    구 신교동
4    구 궁정동
Name: 법정동명, dtype: object

In [21]:
# 찾기
df['법정동명'].str.find('동').head()

0    -1
1    -1
2    12
3    12
4    12
Name: 법정동명, dtype: int64

In [22]:
# 분할
df['법정동명'].str.split().head()

0              [서울특별시]
1         [서울특별시, 종로구]
2    [서울특별시, 종로구, 청운동]
3    [서울특별시, 종로구, 신교동]
4    [서울특별시, 종로구, 궁정동]
Name: 법정동명, dtype: object

In [24]:
# 포함글자 인식
df[df['법정동명'].str.contains('사하구')]

           법정동코드           법정동명 폐지여부
2769  2638000000      부산광역시 사하구   존재
2770  2638010100  부산광역시 사하구 괴정동   존재
2771  2638010200  부산광역시 사하구 당리동   존재
2772  2638010300  부산광역시 사하구 하단동   존재
2773  2638010400  부산광역시 사하구 신평동   존재
2774  2638010500  부산광역시 사하구 장림동   존재
2775  2638010600  부산광역시 사하구 다대동   존재
2776  2638010700  부산광역시 사하구 구평동   존재
2777  2638010800  부산광역시 사하구 감천동   존재

In [25]:
# 문자 대체
df['법정동명'].str.replace(' ','_').head()

0            서울특별시
1        서울특별시_종로구
2    서울특별시_종로구_청운동
3    서울특별시_종로구_신교동
4    서울특별시_종로구_궁정동
Name: 법정동명, dtype: object

In [26]:
s ='ab가나다 ?'
import re
re.sub('[^ㄱ-ㅎㅏ-ㅣ가-힣]', ' ', s)

'  가나다  '

In [27]:
s.replace('[^ㄱ-ㅎㅏ-ㅣ가-힣]', ' ')

'ab가나다 ?'

In [28]:
t = re.sub('[^ㄱ-ㅎㅏ-ㅣ가-힣]', ' ', s)
s, t

('ab가나다 ?', '  가나다  ')

### 6. 인덱스 조작

In [41]:
np.random.seed(0)
df1 = pd.DataFrame(np.vstack([list('ABCDE'),
                              np.round(np.random.rand(3, 5), 2)]).T,
                   columns=["C1", "C2", "C3", "C4"])
df1

  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

- set_index

In [30]:
df2 = df1.set_index('C1')
df2

      C2    C3    C4
C1
A   0.55  0.65  0.79
B   0.72  0.44  0.53
C    0.6  0.89  0.57
D   0.54  0.96  0.93
E   0.42  0.38  0.07

In [32]:
df1.set_index('C1', inplace=True)
df1

      C2    C3    C4
C1
A   0.55  0.65  0.79
B   0.72  0.44  0.53
C    0.6  0.89  0.57
D   0.54  0.96  0.93
E   0.42  0.38  0.07

- reset_index

In [33]:
df1.reset_index()

  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

In [35]:
df1.reset_index(inplace=True)
df1

  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

- rename - column 명 변경

In [42]:
df1.columns = ['N1','N2','N3','N4']
df1

  N1    N2    N3    N4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

In [45]:
df1.rename(columns={'N1':'C1'}, inplace=True)
df1

  C1    N2    N3    N4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

### 7. 데이터프레임 합성

In [36]:
df1 = pd.DataFrame({
    '고객번호': [1001, 1002, 1003, 1004, 1005, 1006, 1007],
    '이름': ['둘리', '도우너', '또치', '길동', '희동', '마이콜', '영희']
}, columns=['고객번호', '이름'])
df1

   고객번호   이름
0  1001   둘리
1  1002  도우너
2  1003   또치
3  1004   길동
4  1005   희동
5  1006  마이콜
6  1007   영희

In [37]:
df2 = pd.DataFrame({
    '고객번호': [1001, 1001, 1005, 1006, 1008, 1001],
    '금액': [10000, 20000, 15000, 5000, 100000, 30000]
}, columns=['고객번호', '금액'])
df2

   고객번호      금액
0  1001   10000
1  1001   20000
2  1005   15000
3  1006    5000
4  1008  100000
5  1001   30000

- merge 함수

In [38]:
# Inner Join
df3 = pd.merge(df1, df2)
df3

   고객번호   이름     금액
0  1001   둘리  10000
1  1001   둘리  20000
2  1001   둘리  30000
3  1005   희동  15000
4  1006  마이콜   5000

In [39]:
# Outer Join
df4 = pd.merge(df1, df2, how='outer')
df4

   고객번호   이름        금액
0  1001   둘리   10000.0
1  1001   둘리   20000.0
2  1001   둘리   30000.0
3  1002  도우너       NaN
4  1003   또치       NaN
5  1004   길동       NaN
6  1005   희동   15000.0
7  1006  마이콜    5000.0
8  1007   영희       NaN
9  1008  NaN  100000.0

### 8. 그룹 분석

In [46]:
iris.head(3)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

In [47]:
iris.tail(3)

     sepal_length  sepal_width  petal_length  petal_width    species
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [48]:
iris.groupby('species').mean()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             5.006        3.428         1.462        0.246
versicolor         5.936        2.770         4.260        1.326
virginica          6.588        2.974         5.552        2.026

In [49]:
iris[['sepal_length','species']].groupby('species').std()

            sepal_length
species
setosa          0.352490
versicolor      0.516171
virginica       0.635880

In [50]:
iris.groupby('species')['sepal_length'].std()

species
setosa        0.352490
versicolor    0.516171
virginica     0.635880
Name: sepal_length, dtype: float64

In [51]:
iris.groupby('species')[['sepal_length']].std()

            sepal_length
species
setosa          0.352490
versicolor      0.516171
virginica       0.635880

In [54]:
iris.groupby('species')['sepal_length'].agg(['mean','std','max','min'])

             mean       std  max  min
species
setosa      5.006  0.352490  5.8  4.3
versicolor  5.936  0.516171  7.0  4.9
virginica   6.588  0.635880  7.9  4.9

In [55]:
titanic.head(3)

   survived  pclass     sex   age  ...  embark_town  alive  alone adult/child
0         0       3    male  22.0  ...  Southampton     no  False       adult
1         1       1  female  38.0  ...    Cherbourg    yes  False       adult
2         1       3  female  26.0  ...  Southampton    yes   True       adult

[3 rows x 16 columns]

In [57]:
titanic.groupby('class')['class'].count()

class
First     216
Second    184
Third     491
Name: class, dtype: int64